---
kind: property
id: P:Autodesk.Revit.DB.PrimarySizeCriterion.MinimumSize
source: html/451d8343-cb26-2fe0-29ac-3e5e14cba4ee.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion.MinimumSize Property

The minimum size of this criterion.

## Syntax (C#)
```csharp
public double MinimumSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.